"""
Написати програму, що зчитує числа від користувача поки не буде введено ключове слово sum.
Коли воно введене, програма повідомляє сумму введених чисел та завершує виконання.
Якщо користувач вводить не число і не ключове слово sum,
програма повідомляє про некоректне введення, але продовжує виконання і пам'ятає контекст.

Наприклад:
Ваше число: 1
Ваше число: 6.5
Ваше число: 9
Ваше число: -17
Ваше число: Число
Введіть число або sum, будь ласка!
Ваше число: 3.5
Ваше число: sum
3
Ця задача має кілька варіантів вирішення і важко одразу сказати який з них є оптимальним.
Спробуйте зробити більше одного, а викладач прокоментує який і чому буде кращим.
"""

# Створюємо список
end = []
# Створюємо змінну для підрахунку
result = 0
# Створюємо нескінченний цикл
i = 1
while not i == 0:
    try:
        x = input('Введіть число або "sum"')
        # Посилюємо шанси програми розпізнати "sum"
        x = x.lower()
        x = x.strip('\n \t.,-:;?!/<>()')
        # Пошук ключового слова (воно в нас одне тому так)
        # Ще можна було через "in"
        if x == 'sum':
            # Розрахунок
            for s in end:
                result = result + s
            print(round(result, 2))
            # Кінець програми
            exit()
        else:
            # Якщо не зможе перевести у "float" тоді перескочить на "print("Ви ввели не число!")"
            x = float(x)
            # Додаємо до списку для подальшого підрахунку
            end.append(x)
    except Exception:
        print("Ви ввели не число!")
