"""
Написати програму, що рахує податок від надхождення на рахунок підприємця.
Вхідні дані:
розмір надходження
відсоток податка
На виході:
скільки потрібно сплатити податку
скільки залишиться чистого прибутку
(обидва значення округлені до двох цифр після коми)
"""

# Запитуємо у користувача вхідні данні
incoming = float(
    input('Для того щоб програма порахувала розмір податка введіть кількість коштів які надійшли на ваш рахунок'))

tax = float(input('Введіть відсоток податка'))

# Формула розрахунку
away = incoming / 100 * tax
netprofit = incoming - away

# Повідомляємо користувачу результат розрахунків
print(
    f'При надходженні {round(incoming, 2)}грн з вас знімуть податок у розмірі {round(away, 2)}грн'
    f' у вас залишиться {round(netprofit, 2)}грн чистого прибутка')
