"""
Написати програму що рахує витрати на паливо.
Вхідні дані:
витрачання палива автомобілем за 100км
сьогоднішня ціна 1 л палива
скільки кілометрів треба здолати
На виході:
скільки грошей на це піде, округлено до двох цифр після коми
"""

# Діалог з користувачем
print('Ця програма порахує скільки грошей ви витратите за поїздку')

# Запитуємо у користувача вхідні данні
consumption = float(input('Яка витрата палива у вашої машини? (л/100км)'))
price = float(input('Скільки коштує пальне?'))
km = float(input('Скільки кілометрів ви збираєтесь проїхати?'))

# Формула розрахунку
sumgrn = km / consumption * price

# Повідомляємо користувачу результат розрахунків
print(f'Вам знадобиться {round(sumgrn, 2)}грн для вашої  поїздки')
