"""
Напишіть програму, яка буде симулювати примітивне бото-спілкування.

Програма має зчитувати строку-звернення від користувача, після чого - шукати ключові слова в цьому зверненні
та відповідати заготовленими фразами.

Реалізуйте наступні пари ключові слова => заготовлена фраза:

Привіт / Хай / Доброго дня => Доброго вечора, я бот з України!
Як справи? / Що робиш? / Чим займаєшся? => Вчусь програмувати на Python!
Фільм / Кінотеатр / Серіал => Соррі що втручуюсь, не знаю про що йдеться (йде),
але подивіться серіал/фільм ваша відповідь, він просто бомба!
Бувай / Надобраніч / Гудбай / До зустрічі => Побачимось у мережі, I'll be back.
Завершити виконання програми
Ключових слів не знайдено => Дуже цікаво, але, нажаль, нічого не зрозуміло :(Якщо хочете, можете додати свої пари теж,
або замінити що існує, але має бути не менше 3 пар та одна з них -
вихід з діалогу. Рекомендую поки не занурюватись занадто глибоко -
через декілька занять ми зможемо зробити цього бота на цікавішому рівні, тому не марнуйте час зараз.

Без циклу while буде важко підтримувати тривалу бото-розмову ;)

Приклад розмови:

Ви: хай)
Бот: Доброго вечора, я бот з України!
Ви: бот-бот, а чим займаєшся?
Бот: Вчусь програмувати на Python!
Ви: Ого, а я серіальчики дивлюсь...
Бот: Соррі що втручуюсь, не знаю про що йдеться (йде), але подивіться серіал "Білий лотсс", він просто бомба!
Ви: ох нічого собі, якийсь бот, а серіал рекомендує
Бот: Соррі що втручуюсь, не знаю про що йдеться (йде), але подивіться серіал "Білий лотсс", він просто бомба!
Ви: та добре тобі, бувай!
Бот: Побачимось у мережі, I'll be back.
"""
"""
Роблю цю домашку одразу після попередньої, тому чесно кажучи не маю бажання включати фантазію...)
"""

# Закріплюємо ключові слова
triger1 = """привіт"""
triger2 = """хай"""
triger3 = """доброго дня"""
triger4 = """як справи"""
triger5 = """що робиш"""
triger6 = """чим займаєшся"""
triger7 = """фільм"""
triger8 = """кінотеатр"""
triger9 = """серіал"""
triger10 = """бувай"""
triger11 = """надобраніч"""
triger12 = """гудбай"""
triger13 = """до зустрічі"""

# Вводимо змінну для того, щоб зробити нескінченний цикл
x = 0

# Попереджуємо користувача про команду швидкого виходу
print('Якщо бажаете завершити діалог достроково напишіть "exit"')

# Запускаємо цикл (нескінченний)
while x == 0:
    # Додаємо строку для вводу
    usercommand = input('Напишіть ваше повідомлення')
    # Використовуємо команду ".strip" для того, щоб "exit" точно було розпознано
    usercommand = usercommand.strip('\n \t.,-:;?!()')
    # Опускаємо регістр (бо я вже знаю наскільки він важливий!)
    usercommand = usercommand.lower()
    # Запускаємо функцію "if" у якій за допомогою команди "in" шукаємо ключові слова у тексті користувача
    if usercommand == 'exit':
        print('exiting...')
        exit()
    elif triger1 in usercommand or triger2 in usercommand or triger3 in usercommand:
        print('Доброго вечора, я бот з України!')
    elif triger4 in usercommand or triger5 in usercommand or triger6 in usercommand:
        print('Вчусь програмувати на Python!')
    elif triger7 in usercommand or triger8 in usercommand or triger9 in usercommand:
        print(
            'Соррі що втручуюсь, не знаю про що йдеться мова, але подивіться серіал "Breaking Bad", він просто бомба!')
    elif triger10 in usercommand or triger11 in usercommand or triger12 in usercommand or triger13 in usercommand:
        print('Побачимось у мережі, I`ll be back.')
        exit()
    else:
        print('Дуже цікаво, але, нажаль, нічого не зрозуміло :(')
# Здається це все
# Це було простіше ніж я думав)
# Гарного дня, до побачення ;)
