"""
I. Написати програму що перевіряє чи є введена строка дзеркальною (паліндромом).
Наприклад, слово "довод", фраза "Аби ріці риба" або числа 84348 та 45677654 - дзеркальні.
Вхідну строку треба перевести в один регістр, позбавити пробілів,
табуляцій, перенесення на нову строку та розділових знаків.
Вхідні дані: строка
На виході: відповідь чи є строка паліндромом
"""

# Додаємо бібліотеку
import math

# Культура)
if __name__ == '__main__':
    # Вхідні дані
    x = input('Введіть строку або число: ')
    # Вхідну строку треба перевести в один регістр, позбавити пробілів,
    # табуляцій, перенесення на нову строку та розділових знаків.
    v = list(x.strip('\t\n (),.;:').lower())
    # ... позбавити пробілів!
    z = []
    for i in v:
        if i != ' ':
            z.append(i)
    # Перевіряємо парність довжини списку за допомогою "if"
    # Бо при непарності довжини не треба враховувати середній символ
    n = len(z)
    if n % 2 == 0:
        # Можна було просто перевести в "int" (можливо так було б навіть краще, але...)
        n = math.ceil(n / 2)
        if z[:n] == list(reversed(z[n:])):
            print(f'{x} є паліндромом')
        else:
            print(f'{x} не є паліндромом')
    else:
        # ... але тому, що тут потрібно округляти в більшу сторону використовуємо ".ceil"
        n = math.ceil(n / 2)
        if z[:n - 1] == list(reversed(z[n:])):
            print(f'{x} є паліндромом')
        else:
            print(f'{x} не є паліндромом')
