"""
II. Написати програму що видаляє те що написано в дужках (), залишивши весь інший текст.
Наприклад з "Я не знав куди йти (втім недивно), тому пішов..."
вийде "Я не знав куди йти, тому пішов...".
Теж саме для текстів з декількома дужками!
Тобто програма-скорочувач для тих кто читає тільки головний контент, а не те що уточнюють в дужках :)
Якщо немає пари дужок, то на виході та ж сама строка без змін.
- Вхідні дані: строка
- На виході: така ж строка, але видалено всі дужки та те що між ними
"""
