"""
II. Написати програму що видаляє те що написано в дужках (), залишивши весь інший текст.
Наприклад з "Я не знав куди йти (втім недивно), тому пішов..."
вийде "Я не знав куди йти, тому пішов...".
Теж саме для текстів з декількома дужками!
Тобто програма-скорочувач для тих кто читає тільки головний контент, а не те що уточнюють в дужках :)
Якщо немає пари дужок, то на виході та ж сама строка без змін.
- Вхідні дані: строка
- На виході: така ж строка, але видалено всі дужки та те що між ними
"""
# Вхідні дані
text = input('Введіть ваш текст: ')
#
x = text.find('(')
y = text.find(')')
#
while not y == -1:
    x = text.find('(')
    y = text.find(')')
    # Без "if" текст в кінці виводився б 2 рази
    # Можна було ще зробити так:
    #                           if y == -1:
    #                               break
    if y != -1:
        text_start = text[:x]
        text_end = text[y + 1:]
        text_start = text_start.strip(' ')
        text_end = text_end.strip(' ')
        text = text_start + text_end
print(text)
# Дякую за увагу, гарного дня)
